# Pandas II: Aggregations

<h3>Table of Contents<span class="tocSkip"></span></h3>
<div class="toc"><ul class="toc-item"><li><span><a href="#Data-aggregation" data-toc-modified-id="Data-aggregation-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Data aggregation</a></span><ul class="toc-item"><li><span><a href="#groupby" data-toc-modified-id="groupby-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>groupby</a></span><ul class="toc-item"><li><span><a href="#groupby-&amp;-aggregate" data-toc-modified-id="groupby-&amp;-aggregate-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>groupby &amp; aggregate</a></span></li></ul></li><li><span><a href="#Pivot-Tables" data-toc-modified-id="Pivot-Tables-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Pivot Tables</a></span></li><li><span><a href="#Differences-between-pivot-table-and-groupby-function" data-toc-modified-id="Differences-between-pivot-table-and-groupby-function-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Differences between pivot table and groupby function</a></span></li><li><span><a href="#crosstab" data-toc-modified-id="crosstab-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>crosstab</a></span></li></ul></li><li><span><a href="#Data-combination:-mixing-dataframes" data-toc-modified-id="Data-combination:-mixing-dataframes-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Data combination: mixing dataframes</a></span><ul class="toc-item"><li><span><a href="#Concat:-two-things-together" data-toc-modified-id="Concat:-two-things-together-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Concat: two things together</a></span><ul class="toc-item"><li><span><a href="#Concatenating-on-axis-0-(rows)" data-toc-modified-id="Concatenating-on-axis-0-(rows)-2.1.1"><span class="toc-item-num">2.1.1&nbsp;&nbsp;</span>Concatenating on axis 0 (rows)</a></span></li><li><span><a href="#Concatenating-on-axis-1-(columns)" data-toc-modified-id="Concatenating-on-axis-1-(columns)-2.1.2"><span class="toc-item-num">2.1.2&nbsp;&nbsp;</span>Concatenating on axis 1 (columns)</a></span></li></ul></li><li><span><a href="#Merge:-related-columns" data-toc-modified-id="Merge:-related-columns-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Merge: related columns</a></span><ul class="toc-item"><li><span><a href="#LEFT-Merge" data-toc-modified-id="LEFT-Merge-2.2.1"><span class="toc-item-num">2.2.1&nbsp;&nbsp;</span>LEFT Merge</a></span></li><li><span><a href="#RIGHT-Merge" data-toc-modified-id="RIGHT-Merge-2.2.2"><span class="toc-item-num">2.2.2&nbsp;&nbsp;</span>RIGHT Merge</a></span></li><li><span><a href="#INNER-Merge" data-toc-modified-id="INNER-Merge-2.2.3"><span class="toc-item-num">2.2.3&nbsp;&nbsp;</span>INNER Merge</a></span></li><li><span><a href="#OUTER-Merge" data-toc-modified-id="OUTER-Merge-2.2.4"><span class="toc-item-num">2.2.4&nbsp;&nbsp;</span>OUTER Merge</a></span></li></ul></li><li><span><a href="#Merging-&amp;-Concatenating-in-two-different-columns" data-toc-modified-id="Merging-&amp;-Concatenating-in-two-different-columns-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Merging &amp; Concatenating in two different columns</a></span><ul class="toc-item"><li><span><a href="#Concatenating-in-two-different-columns" data-toc-modified-id="Concatenating-in-two-different-columns-2.3.1"><span class="toc-item-num">2.3.1&nbsp;&nbsp;</span>Concatenating in two different columns</a></span></li><li><span><a href="#Merging-in-two-different-columns" data-toc-modified-id="Merging-in-two-different-columns-2.3.2"><span class="toc-item-num">2.3.2&nbsp;&nbsp;</span>Merging in two different columns</a></span></li></ul></li><li><span><a href="#Pandas-usual-methods" data-toc-modified-id="Pandas-usual-methods-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Pandas usual methods</a></span></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Further materials</a></span></li></ul></div>

![](https://miro.medium.com/max/1400/1*6d5dw6dPhy4vBp2vRW6uzw.webp)

## Import Pandas and Data
First, we import the main libraries:

In [1]:
import pandas as pd
import numpy as np

pd.set_option('display.max_columns', None)

df = pd.read_csv("/Users/chandlershortlidge/Downloads/employees.csv")
df.shape

(1470, 35)

In [2]:
df.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NumCompaniesWorked,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,2,Female,94,3,2,Sales Executive,4,Single,5993,19479,8,Y,Yes,11,3,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,3,Male,61,2,2,Research Scientist,2,Married,5130,24907,1,Y,No,23,4,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,4,Male,92,2,1,Laboratory Technician,3,Single,2090,2396,6,Y,Yes,15,3,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,4,Female,56,3,1,Research Scientist,3,Married,2909,23159,1,Y,Yes,11,3,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,1,Male,40,3,1,Laboratory Technician,2,Married,3468,16632,9,Y,No,12,3,4,80,1,6,3,3,2,2,2,2

In [3]:
df.describe()

,Age,DailyRate,DistanceFromHome,Education,EmployeeCount,EmployeeNumber,EnvironmentSatisfaction,HourlyRate,JobInvolvement,JobLevel,JobSatisfaction,MonthlyIncome,MonthlyRate,NumCompaniesWorked,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
count,1470.000000,1470.000000,1470.000000,1470.000000,1470.0,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.0,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000
mean,36.923810,802.485714,9.192517,2.912925,1.0,1024.865306,2.721769,65.891156,2.729932,2.063946,2.728571,6502.931293,14313.103401,2.693197,15.209524,3.153741,2.712245,80.0,0.793878,11.279592,2.799320,2.761224,7.008163,4.229252,2.187755,4.123129
std,9.135373,403.509100,8.106864,1.024165,0.0,602.024335,1.093082,20.329428,0.711561,1.106940,1.102846,4707.956783,7117.786044,2.498009,3.659938,0.360824,1.081209,0.0,0.852077,7.780782,1.289271,0.706476,6.126525,3.623137,3.222430,3.568136
min,18.000000,102.000000,1.000000,1.000000,1.0,1.000000,1.000000,30.000000,1.000000,1.000000,1.000000,1009.000000,2094.000000,0.000000,11.000000,3.000000,1.000000,80.0,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000
25%,30.000000,465.000000,2.000000,2.000000,1.0,491.250000,2.000000,48.000000,2.000000,1.000000,2.000000,2911.000000,8047.000000,1.000000,12.000000,3.000000,2.000000,80.0,0.000000,6.000000,2.000000,2.000000,3.000000,2.000000,0.000000,2.000000
50%,36.000000,802.000000,7.000000,3.000000,1.0,1020.500000,3.000000,66.000000,3.000000,2.000000,3.000000,4919.000000,14235.500000,2.000000,14.000000,3.000000,3.000000,80.0,1.000000,10.000000,3.000000,3.000000,5.000000,3.000000,1.000000,3.000000
75%,43.000000,1157.000000,14.000000,4.000000,1.0,1555.750000,4.000000,83.750000,3.000000,3.000000,4.000000,8379.000000,20461.500000,4.000000,18.000000,3.000000,4.000000,80.0,1.000000,15.000000,3.000000,3.000000,9.000000,7.000000,3.000000,7.000000
max,60.000000,1499.000000,29.000000,5.000000,1.0,2068.000000,4.000000,100.000000,4.000000,5.000000,4.000000,19999.000000,26999.000000,9.000000,25.000000,4.000000,4.000000,80.0,3.000000,40.000000,6.000000,4.000000,40.000000,18.000000,15.000000,17.000000

In [4]:
df.info() # no missing data :)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 35 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1470 non-null   int64
 1   Attrition                 1470 non-null   object
 2   BusinessTravel            1470 non-null   object
 3   DailyRate                 1470 non-null   int64
 4   Department                1470 non-null   object
 5   DistanceFromHome          1470 non-null   int64
 6   Education                 1470 non-null   int64
 7   EducationField            1470 non-null   object
 8   EmployeeCount             1470 non-null   int64
 9   EmployeeNumber            1470 non-null   int64
 10  EnvironmentSatisfaction   1470 non-null   int64
 11  Gender                    1470 non-null   object
 12  HourlyRate                1470 non-null   int64
 13  JobInvolvement            1470 non-null   int64
 14  JobLevel                  1470 non-null   int64
 15  JobRole                   1470 non-null   object
 16  JobSatisfaction           1470 non-null   int64
 17  MaritalStatus             1470 non-null   object
 18  MonthlyIncome             1470 non-null   int64
 19  MonthlyRate               1470 non-null   int64
 20  NumCompaniesWorked        1470 non-null   int64
 21  Over18                    1470 non-null   object
 22  OverTime                  1470 non-null   object
 23  PercentSalaryHike         1470 non-null   int64
 24  PerformanceRating         1470 non-null   int64
 25  RelationshipSatisfaction  1470 non-null   int64
 26  StandardHours             1470 non-null   int64
 27  StockOptionLevel          1470 non-null   int64
 28  TotalWorkingYears         1470 non-null   int64
 29  TrainingTimesLastYear     1470 non-null   int64
 30  WorkLifeBalance           1470 non-null   int64
 31  YearsAtCompany            1470 non-null   int64
 32  YearsInCurrentRole        1470 non-null   int64
 33  YearsSinceLastPromotion   1470 non-null   int64
 34  YearsWithCurrManager      1470 non-null   int64
dtypes: int64(26), object(9)
memory usage: 402.1+ KB

## Data aggregation

Data aggregation is a fundamental technique in data analysis that involves grouping and summarizing data to gain insights and make informed decisions. In this section, we will explore essential Pandas methods for data aggregation, including `groupby`, `pivot_table`, and `crosstab`.

These techniques are particularly useful when dealing with large datasets or when you need to summarize data across different categories or dimensions. Whether you want to calculate statistics for specific groups, create summary tables, or analyze relationships between variables, data aggregation methods in Pandas provide the tools to streamline your analysis.

Let's dive into each of these methods and discover how they can help you uncover meaningful patterns and trends within your data.

### groupby
(This is one of the most important things you will learn)

![groupby](https://miro.medium.com/v2/resize:fit:720/format:webp/0*m-puRNwcnUl5zZ4O)

Pandas GroupBy is a powerful and versatile function in Python that is indispensable for data manipulation and analysis. It enables us to split a DataFrame into separate groups based on one or more criteria and perform various calculations on these groups for in-depth analysis.

The concept is straightforward: you select a DataFrame, specify the categories or criteria by which you want to group your data, and then apply aggregation functions to each group. These aggregation functions can include calculations like sum, mean, count, or even custom-defined functions, depending on your analysis goals.

GroupBy operations are invaluable for tasks such as summarizing data, exploring patterns within specific groups, or comparing different segments of your dataset. Whether you're working with sales data, customer behavior, or any other structured data, Pandas GroupBy is your go-to tool.

Here's a basic syntax to use GroupBy:

`df[subset].groupby(category).aggregation()`

To dive deeper into the capabilities and options of Pandas GroupBy, you can refer to the official documentation [here](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html).

`groupby the departments and their mean age`

In [5]:
# Let's look at the df
# print(df.info())
df.head(15)

df[["Department", "Age"]]#.groupby("Department").mean()
df[["Department", "Age"]].groupby("Department").count()
df[["Department", "Age"]].groupby("Department").mean()

                              Age
Department
Human Resources         37.809524
Research & Development  37.042664
Sales                   36.542601

In [6]:
# BUILT IN AGGREGATIONS
# There are two ways of doing it (1st)
df[["Age", "Department"]].groupby("Department").mean()
df[["Age", "Department"]].groupby("Department").max()
df[["Age", "Department"]].groupby("Department").min()

                        Age
Department
Human Resources          19
Research & Development   18
Sales                    18

In [7]:
# Generalized code
# df [ [list of columns] ].groupby(by=[list of dimensions to aggregate by]).agg({list of functions}
df[["Age", "Department"]].groupby("Department").agg("mean")

                              Age
Department
Human Resources         37.809524
Research & Development  37.042664
Sales                   36.542601

`groupby: 2+`: Different Education Fields and their Mean Salaries in each of the Department

In [8]:
df[["EducationField", "HourlyRate", "Department", "Age"]].groupby(by=["Department", "EducationField"]).agg({"HourlyRate":"mean", "Age":"mean"})

                                         HourlyRate        Age
Department             EducationField
Human Resources        Human Resources    60.888889  37.037037
                       Life Sciences      61.625000  39.375000
                       Medical            72.076923  39.846154
                       Other              76.000000  34.666667
                       Technical Degree   64.000000  32.500000
Research & Development Life Sciences      66.570455  36.997727
                       Medical            66.330579  37.242424
                       Other              62.203125  36.187500
                       Technical Degree   66.351064  37.063830
Sales                  Life Sciences      68.153333  37.186667
                       Marketing          66.150943  37.924528
                       Medical            59.943182  34.727273
                       Other              60.333333  32.000000
                       Technical Degree   67.676471  33.941176

`more fields`

In [9]:
df[["EducationField", "HourlyRate", "Department", "StandardHours", "Age"]].groupby(by=["Department", "EducationField"]).mean()

                                         HourlyRate  StandardHours        Age
Department             EducationField
Human Resources        Human Resources    60.888889           80.0  37.037037
                       Life Sciences      61.625000           80.0  39.375000
                       Medical            72.076923           80.0  39.846154
                       Other              76.000000           80.0  34.666667
                       Technical Degree   64.000000           80.0  32.500000
Research & Development Life Sciences      66.570455           80.0  36.997727
                       Medical            66.330579           80.0  37.242424
                       Other              62.203125           80.0  36.187500
                       Technical Degree   66.351064           80.0  37.063830
Sales                  Life Sciences      68.153333           80.0  37.186667
                       Marketing          66.150943           80.0  37.924528
                       Medical            59.943182           80.0  34.727273
                       Other              60.333333           80.0  32.000000
                       Technical Degree   67.676471           80.0  33.941176

#### groupby & aggregate

In Pandas, the "agg" function is a powerful tool for aggregating data within groups created using the GroupBy operation. It allows you to apply multiple aggregation functions simultaneously, providing concise and flexible control over your data summarization.

Here are some common aggregation functions that can be used with the "agg" syntax:
- **mean**: Calculates the mean (average) of the values in each group.
- **sum**: Adds up all the values in each group.
- **count**: Counts the number of rows in each group.

Using the "agg" function, you can specify these aggregation functions and more, tailoring your data summarization to match your specific analysis requirements. This flexibility is especially useful when you need to obtain various statistics from your grouped data simultaneously.

For more details and advanced options regarding the "agg" function, you can refer to the official Pandas documentation [here](https://pandas.pydata.org/docs/reference/api/pandas.core.groupby.DataFrameGroupBy.aggregate.html).

### Pivot Tables

In data analysis, pivot tables are a valuable tool for reshaping and summarizing data, especially when you need to analyze and compare multiple aspects of your dataset simultaneously. Pandas provides a versatile `pivot_table` function that allows you to create spreadsheet-style pivot tables within your DataFrame.

The `pivot_table` function takes several key parameters:
- `df`: The DataFrame you want to pivot.
- `values`: The columns containing the values you want to aggregate.
- `index`: The columns that will become the new index of the pivot table.
- `columns`: The columns that will become the new columns of the pivot table.
- `aggfunc`: The aggregation function to be applied to the values (default is 'mean').

When you apply the `pivot_table` function, it organizes your data into a more structured format, with hierarchical indexing on both rows and columns. This structure makes it easy to perform various aggregation operations, such as calculating means, sums, or counts across different groups and dimensions.

For a detailed comparison of when to use `groupby` versus `pivot_table`, you can refer to this informative article: [GroupBy vs. Pivot Table](https://towardsdatascience.com/a-comparison-of-groupby-and-pivot-in-pythons-pandas-module-527909e78d6b).

Utilizing pivot tables effectively can significantly enhance your data analysis capabilities and help you uncover insights from complex datasets.

To learn more about the `pivot_table` function and its advanced options, you can refer to the official Pandas documentation [here](https://pandas.pydata.org/docs/reference/api/pandas.pivot_table.html).

`pivot table`: the department and their mean ages

In [10]:
df.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NumCompaniesWorked,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,2,Female,94,3,2,Sales Executive,4,Single,5993,19479,8,Y,Yes,11,3,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,3,Male,61,2,2,Research Scientist,2,Married,5130,24907,1,Y,No,23,4,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,4,Male,92,2,1,Laboratory Technician,3,Single,2090,2396,6,Y,Yes,15,3,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,4,Female,56,3,1,Research Scientist,3,Married,2909,23159,1,Y,Yes,11,3,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,1,Male,40,3,1,Laboratory Technician,2,Married,3468,16632,9,Y,No,12,3,4,80,1,6,3,3,2,2,2,2

In [11]:
# Example, calculating mean age by department
df.pivot_table(
    values = "Age",
    index = "Department",
    aggfunc = "mean"
)

                              Age
Department
Human Resources         37.809524
Research & Development  37.042664
Sales                   36.542601

Now, is your **turn**:

`pivot table`: the department and their max ages

`pivot table`: the department and their min ages

`pivot table`: the department and their median age

`multi-index pivot table`: Department and Education Field and check the maximum salary values of employees

In [12]:
# Example, calculating mean age by department and EducationField
df.pivot_table (
    values = "MonthlyIncome",
    index = ["Department", "EducationField"],
    aggfunc = "max"
)

                                         MonthlyIncome
Department             EducationField
Human Resources        Human Resources           19636
                       Life Sciences             19717
                       Medical                   18200
                       Other                      7988
                       Technical Degree           4323
Research & Development Life Sciences             19999
                       Medical                   19859
                       Other                     19613
                       Technical Degree          19943
Sales                  Life Sciences             19847
                       Marketing                 19845
                       Medical                   19833
                       Other                     10932
                       Technical Degree          16872

### crosstab

In data analysis, understanding the relationships between categorical variables is often crucial for gaining insights into your dataset. Pandas offers a powerful tool called `crosstab` that helps you compute a simple cross-tabulation of two or more factors within your DataFrame.

The `pd.crosstab()` function is designed for this purpose and is particularly useful when you want to examine the frequency or distribution of one categorical variable relative to another. By default, it computes a frequency table, but you can also pass an array of values and an aggregation function for more advanced analysis.

Here's the basic syntax:
```python
pd.crosstab(df[column1], df[column2])
```

In [13]:
# Example I
pd.crosstab(df["Department"], df["EducationField"])

EducationField,Human Resources,Life Sciences,Marketing,Medical,Other,Technical Degree
Department,,,,,,
Human Resources,27,16,0,13,3,4
Research & Development,0,440,0,363,64,94
Sales,0,150,159,88,15,34

In [14]:
# Example II
pd.crosstab(df["Department"], df["EducationField"], df["MonthlyIncome"], aggfunc="mean")

EducationField,Human Resources,Life Sciences,Marketing,Medical,Other,Technical Degree
Department,,,,,,
Human Resources,7241.148148,6914.062500,NaN,6594.076923,5016.666667,3081.250000
Research & Development,NaN,6179.984091,NaN,6539.223140,6278.687500,5760.819149
Sales,NaN,7246.233333,7348.584906,6377.227273,5398.733333,6066.294118

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

## Data combination: mixing dataframes

In real-world data analysis, you often encounter scenarios where you need to combine data from different sources or organize it differently to perform meaningful analysis. Pandas provides several powerful methods for merging, joining, and concatenating DataFrames to help you manage this process efficiently.

For a comprehensive understanding of these techniques, consider exploring the following resources:
- [Real Python: Pandas Merge, Join, and Concat](https://realpython.com/pandas-merge-join-and-concat/)
- [Pandas Documentation: Merging and Joining](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)

### Concat: two things together

![Union operation.png]()

Concatenation is one of the fundamental operations for combining DataFrames. With `pd.concat()`, you can effortlessly join DataFrames along a specified axis, usually along axis 0 (vertically), to stack them one below the other. This aligns columns based on their labels, making it a valuable tool for extending or appending data vertically.

The basic syntax for concatenation is as follows:
```python
result = pd.concat([df1, df2, ...], axis=0)
```
Here, `df1`, `df2`, and so on are the DataFrames you want to concatenate. The `axis=0` argument ensures that the concatenation occurs vertically, aligning rows.

By mastering concatenation, you can efficiently manage datasets that grow over time or combine data from various sources into a single cohesive DataFrame. This is particularly useful when dealing with time series data, log files, or other situations where data is collected incrementally.

To delve deeper into concatenation and explore more advanced options, you can refer to the provided resources and the official Pandas documentation on [pd.concat()](https://pandas.pydata.org/docs/reference/api/pandas.concat.html).

#### Concat

In [15]:
# Load some data
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',
                             sep='|',
                             index_col='user_id')

In [16]:
df.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [17]:
# Let's sample it
first_df = df.sample(frac=0.1)
second_df = df.sample(frac=0.1)

display(first_df.head()); display(second_df.head())

         age gender occupation zip_code
user_id
484       27      M    student    21208
334       32      M  librarian    30002
808       45      M   salesman    90016
905       27      M      other    30350
519       22      M      other    55320

         age gender     occupation zip_code
user_id
322       20      M        student    50613
514       27      M     programmer    20707
437       27      F          other    20009
894       47      M       educator    74075
191       33      M  administrator    95161

#### Concatenating on axis 0 (rows)

In [18]:
pd.concat([first_df, second_df], axis=0, keys=["Table 1", "Table 2"])

## You dont actually need keys
#pd.concat([first_df, second_df], axis=0)

                 age gender occupation zip_code
        user_id
Table 1 484       27      M    student    21208
        334       32      M  librarian    30002
        808       45      M   salesman    90016
        905       27      M      other    30350
        519       22      M      other    55320
...              ...    ...        ...      ...
Table 2 434       16      F    student    49705
        744       35      M  marketing    47024
        426       55      M   educator    01602
        153       25      M    student    60641
        754       59      F  librarian    62901

[188 rows x 4 columns]

- This operation concatenates the DataFrames `first_df` and `second_df` vertically (along `axis=0`), meaning it stacks them on top of each other.

- The `keys` parameter is used to specify a hierarchical index for the resulting DataFrame. In this case, you're giving each original DataFrame a label: "Table 1" and "Table 2."

- As a result, the output will be a new DataFrame with a hierarchical (MultiIndex) structure. You can think of it as having two sections labeled "Table 1" and "Table 2," where each section contains the data from the respective original DataFrame.

#### Concatenating on axis 1 (columns)

In [19]:
pd.concat([first_df, second_df], axis=1, keys=["left", "right"])

## Why do we get a sparse table?

         left                            right
          age gender occupation zip_code   age gender occupation zip_code
user_id
484      27.0      M    student    21208   NaN    NaN        NaN      NaN
334      32.0      M  librarian    30002   NaN    NaN        NaN      NaN
808      45.0      M   salesman    90016   NaN    NaN        NaN      NaN
905      27.0      M      other    30350  27.0      M      other    30350
519      22.0      M      other    55320   NaN    NaN        NaN      NaN
...       ...    ...        ...      ...   ...    ...        ...      ...
434       NaN    NaN        NaN      NaN  16.0      F    student    49705
744       NaN    NaN        NaN      NaN  35.0      M  marketing    47024
426       NaN    NaN        NaN      NaN  55.0      M   educator    01602
153       NaN    NaN        NaN      NaN  25.0      M    student    60641
754       NaN    NaN        NaN      NaN  59.0      F  librarian    62901

[178 rows x 8 columns]

- This operation concatenates the DataFrames `first_df` and `second_df` horizontally (along `axis=1`), meaning it combines them side by side.

- Similar to the first operation, the `keys` parameter is used to label the columns resulting from each original DataFrame. Here, you're labeling them as "left" and " right."

- The output will be a new DataFrame where the columns are organized into two sections labeled "left" and " right," representing the data from the respective original DataFrames.

## Merge - One of the most important things you will learn

INDUSTRY NAME: Join

Methods in Pandas: .merge() and .join()

![sql joins](https://upload.wikimedia.org/wikipedia/commons/9/9d/SQL_Joins.svg)

![join](https://www.journalofaccountancy.com/content/dam/jofa/archive/issues/2008/09/ex1-jth.gif)

![image](https://wac-cdn.atlassian.com/dam/jcr:b033c1f2-b354-44ac-982f-6e4db0c97d71/sqlJoins_7.png?cdnVersion=1604)

### Merge: related columns

The `merge()` function in Pandas is a powerful tool when you need to combine rows from multiple DataFrames based on related columns. It's primarily used for database-style joins where you want to bring together data from different sources that share common key columns.

**Understanding the `merge()` Function**:

You can think of the `merge()` function as a way to merge rows that share data across specified columns. It allows you to perform various types of joins, such as inner, outer, left, and right joins, which determine how rows from both DataFrames are combined.

- **Inner Join**: This type of join returns only the rows where there is a match in both DataFrames based on the specified columns. Rows without a match are excluded.

- **Outer Join (Full Outer Join)**: An outer join returns all rows when there is a match in either the left or right DataFrame. Unmatched rows will contain NaN values for the missing data.

- **Left Join (Left Outer Join)**: A left join returns all rows from the left DataFrame and the matched rows from the right DataFrame. Unmatched rows from the left DataFrame will still be included.

- **Right Join (Right Outer Join)**: Conversely, a right join returns all rows from the right DataFrame and the matched rows from the left DataFrame. Unmatched rows from the right DataFrame will still be included.

**Usage and Syntax**:

Here's a basic outline of how to use the `merge()` function:

```python
merged_df = pd.merge(left_df, right_df, on='common_column', how='join_type')
```
- **Usage and Syntax:**

  - `left_df`: The left DataFrame you want to merge.
  - `right_df`: The right DataFrame you want to merge.
  - `on`: The column(s) on which you want to perform the merge. These columns should exist in both DataFrames and serve as the key(s) for the merge operation.
  - `how`: The type of join you want to perform (e.g., 'inner', 'outer', 'left', 'right').

- **Benefits of Using `merge()`:**

  - **Data Integration:** Merge helps integrate data from multiple sources or tables into a single, comprehensive dataset.

  - **Data Analysis:** It simplifies the process of combining related information, making it easier to analyze data and derive insights.

  - **Database Operations:** `merge()` aligns with common database operations like SQL joins, allowing data analysts to leverage their SQL knowledge within Pandas.

  - **Complex Queries:** You can handle complex data relationships and perform queries that involve multiple tables efficiently.

Merging DataFrames using `merge()` is a fundamental operation in data manipulation and analysis, especially when dealing with real-world datasets from various sources. It provides you with the flexibility to control how data is combined and allows you to work with complex data relationships.

For more detailed information and options, you can refer to the official Pandas documentation on [`merge()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html).

#### LEFT Merge

In [20]:
from IPython.display import display_html

In [21]:
df1 = pd.DataFrame(
    {
        "key1": ["K0", "K0", "K1", "K2"],
        "key2": ["K0", "K1", "K0", "K1"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)


df2 = pd.DataFrame(
    {
        "key1": ["K0", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K0", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)

df3 = pd.DataFrame(
    {
        "key1": ["K90", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K5", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "Y": ["D0", "D70", "D2", "D5"],
    }
)

In [22]:
# Just showing tables
df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
display_html(df1_styler._repr_html_() + " " + df2_styler._repr_html_(), raw=True)

,key1,key2,A,B
0,K0,K0,A0,B0
1,K0,K1,A1,B1
2,K1,K0,A2,B2
3,K2,K1,A3,B3
,key1,key2,C,D
0,K0,K0,C0,D0
1,K1,K0,C1,D1
2,K1,K0,C2,D2
3,K2,K0,C3,D3

In [23]:
#merge, default is inner
pd.merge(df1, df2)

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [24]:
# merges, now is a left
pd.merge(df1, df2, how="left")

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [25]:
# merges, now is a right
pd.merge(df1, df2, how="right")

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [26]:
#merge, now is inner
pd.merge(df1, df2, how="inner")

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [27]:
# merge, now is outer
pd.merge(df1, df2, how="outer")

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K0  NaN  NaN   C3   D3
5   K2   K1   A3   B3  NaN  NaN

### Merging & Concatenating in two different columns

In [28]:
df1_docs = pd.DataFrame({'Locations': ['Spain', 'France', 'Portugal', 'Spain'],
                    'city': ["Barcelona", "Paris", "Lisbon", "Madrid"]})
df2_docs = pd.DataFrame({'More locations': ['Spain', 'France', 'Portugal', 'Spain'],
                    'city': ["Madrid", "Lyon", "Porto", "Albacete"]})

#### Concatenating in two different columns

In [29]:
pd.concat([df1_docs, df2_docs], axis=1, keys=["1st table", "2nd table"])

  1st table                 2nd table
  Locations       city More locations      city
0     Spain  Barcelona          Spain    Madrid
1    France      Paris         France      Lyon
2  Portugal     Lisbon       Portugal     Porto
3     Spain     Madrid          Spain  Albacete

#### Merging in two different columns

In [30]:
df1_docs.merge(df2_docs, how = 'inner', left_on='Locations', right_on='More locations', suffixes = ["_fromlastyear", "_fromthisyear"])
## Are you expecting 2 or 4 lines for spain?

  Locations city_fromlastyear More locations city_fromthisyear
0     Spain         Barcelona          Spain            Madrid
1     Spain         Barcelona          Spain          Albacete
2    France             Paris         France              Lyon
3  Portugal            Lisbon       Portugal             Porto
4     Spain            Madrid          Spain            Madrid
5     Spain            Madrid          Spain          Albacete

In [31]:
df1_docs.merge(df2_docs,  left_on='Locations', right_on='More locations', suffixes = ["_fromleft", "_fromright"])

  Locations city_fromleft More locations city_fromright
0     Spain     Barcelona          Spain         Madrid
1     Spain     Barcelona          Spain       Albacete
2    France         Paris         France           Lyon
3  Portugal        Lisbon       Portugal          Porto
4     Spain        Madrid          Spain         Madrid
5     Spain        Madrid          Spain       Albacete

## Lets do an exercise together

In [32]:
import pandas as pd
data = pd.read_excel('datasets/Sample - Superstore.xls')

ImportError: Missing optional dependency 'xlrd'. Install xlrd >= 2.0.1 for xls Excel support Use pip or conda to install xlrd.

In [ ]:
# Get what are the different values of "Ship Mode"

list(data['Ship Mode'].unique())
# set(data['Ship Mode'])

data['Ship Mode'].value_counts()

# Who were the most/least profitable countries?
data[['Profit','State']]

sorted_countries = data.groupby('State')['Profit'].sum().sort_values(ascending = False)
sorted_countries

State
California              76381.3871
New York                74038.5486
Washington              33402.6517
Michigan                24463.1876
Virginia                18597.9504
Indiana                 18382.9363
Georgia                 16250.0433
Kentucky                11199.6966
Minnesota               10823.1874
Delaware                 9977.3748
New Jersey               9772.9138
Wisconsin                8401.8004
Rhode Island             7285.6293
Maryland                 7031.1788
Massachusetts            6785.5016
Missouri                 6436.2105
Alabama                  5786.8253
Oklahoma                 4853.9560
Arkansas                 4008.6871
Connecticut              3511.4918
Nevada                   3316.7659
Mississippi              3172.9762
Utah                     2546.5335
Vermont                  2244.9783
Louisiana                2196.1023
Nebraska                 2037.0942
Montana                  1833.3285
South Carolina           1769.0566
New Hampshire            1706.5028
Iowa                     1183.8119
New Mexico               1157.1161
District of Columbia     1059.5893
Kansas                    836.4435
Idaho                     826.7231
Maine                     454.4862
South Dakota              394.8283
North Dakota              230.1497
West Virginia             185.9216
Wyoming                   100.1960
Oregon                  -1190.4705
Florida                 -3399.3017
Arizona                 -3427.9246
Tennessee               -5341.6936
Colorado                -6527.8579
North Carolina          -7490.9122
Illinois               -12607.8870
Pennsylvania           -15559.9603
Ohio                   -16971.3766
Texas                  -25729.3563
Name: Profit, dtype: float64

In [ ]:
# What was the most unprofitable product category and sub categotry?

profit_analysis = data.groupby(['Category','Sub-Category'])['Profit'].sum().sort_values(ascending = False)

# what is the structure of this pandas data series? how can that be if it has 3 columns?
profit_analysis = pd.DataFrame(profit_analysis)
profit_analysis

                                  Profit
Category        Sub-Category
Technology      Copiers       55617.8249
                Phones        44515.7306
                Accessories   41936.6357
Office Supplies Paper         34053.5693
                Binders       30221.7633
Furniture       Chairs        26590.1663
Office Supplies Storage       21278.8264
                Appliances    18138.0054
Furniture       Furnishings   13059.1436
Office Supplies Envelopes      6964.1767
                Art            6527.7870
                Labels         5546.2540
Technology      Machines       3384.7569
Office Supplies Fasteners       949.5182
                Supplies      -1189.0995
Furniture       Bookcases     -3472.5560
                Tables       -17725.4811

In [ ]:
# The most unprofitable subcategory overall is responsible for how much of the losses in the most unprofitable state?
# What we need to do:
# - Get the most unprofitable state
# - Get the most unprofitable category
# - Get data for this state and this subcategory
# - Get the data for this state
# - Compute the % worth for that subcategory in that state

# - Get the most unprofitable State
most_unprofitable = data.groupby(['State'])['Profit'].sum().sort_values()
most_unprofitable = most_unprofitable.index[0]

# - Get the most unprofitable category
most_unprofitable_subcat = data.groupby(['Sub-Category'])['Profit'].sum().sort_values()
most_unprofitable_subcat = most_unprofitable_subcat.index[0]
most_unprofitable_subcat

# - Get data for this State and this subcategory
condition = ((data['State'] == most_unprofitable) & (data['Sub-Category'] == most_unprofitable_subcat))
numerator = data[condition]['Profit'].sum()

# - Get the data for this State
condition2 = (data['State'] == most_unprofitable)
denominator = data[condition2]['Profit'].sum()

# - Compute the % worth for that subcategory in that State
print('The most unprofitable subcategory is '+str(most_unprofitable_subcat))
print('The most unprofitable State is '+str(most_unprofitable))

string_to_print = f"The profit of {most_unprofitable_subcat} in {most_unprofitable} is {numerator} out of {denominator}, \
which represents {round(100*numerator/denominator, 2)}%"

print(string_to_print)

The most unprofitable subcategory is Tables
The most unprofitable State is Texas
The profit of Tables in Texas is -2216.6766000000007 out of -25729.35630000001, which represents 8.62%

## Business challenge: Glovo orders analysis (use pycharm)

Business challenge: Glovo orders analysis (use pycharm)

In this analysis, we will explore a dataset containing information about orders from Fake partners within the app. Fake partners are stores not directly integrated with Glovo, and our content team manages their product catalog and prices. This dataset provides details on orders, payment discrepancies, and other relevant information.

1. Dataset Description
    - `order_id`: Unique identifier for each order.
    - `activation_time_local`: Local time when the order was activated.
    - `country_code`: Country code for the order.
    - `store_address`: Address of the store.
    - `final_status`: The final status of the order.
    - `payment_status`: The payment status of the order.
    - `products`: Number of products in the order.
    - `products_total`: Total amount at checkout in euros ().
    - `purchase_total_price`: Amount the courier paid at the store in euros ().

2. Background
Fake partner orders can exhibit discrepancies between the total amount at checkout (`products_total`) and the amount the courier pays at the store (`purchase_total_price`). When `products_total` is lower than `purchase_total_price`, we classify them as "under-authorized orders." Understanding these discrepancies is crucial for transitioning from charge-on-delivery to an authorize-and-capture model.

3. Key Questions
During this EDA process, we aim to answer the following questions:

    1. What percentage of orders are under-authorized?
    2. What percentage of orders would be correctly authorized with a 20% incremental authorization on the amount at checkout?
    3. Are there differences in the above percentages when split by country?
    4. For the remaining orders outside of incremental authorization, what values would be necessary to capture the remaining amount?
    5. Which stores are the most problematic in terms of orders and monetary value?

Through this analysis, we aim to gain insights into the price fluctuations of past orders and assess the risk associated with transitioning to a new authorization model.

Let's dive into the dataset and start exploring!

In [ ]:
# Load the dataset
df = pd.read_csv("datasets/fake_orders_test.csv")

# RECAP

RECAP

## Subsets
- Select specific columns:
  - `df[[col1, col2]]`

## Aggregations
### Groupby
- Perform aggregations based on a categorical column:
  - `df[[col1, col2]].groupby(CATEGORICAL).agg({QUANTITATIVE_1: "mean", QUANTITATIVE_2: "max"})`
  - `df[[col1, col2]].groupby(CATEGORICAL).mean()`
- Common aggregation functions:
  - count, mean, max, min, median, std, and more.

### Pivot Table
- Create pivot tables to summarize data:
  - `df.pivot_table(values="MonthlyIncome", index="Department", aggfunc="mean")`
- Pivot tables offer a concise way to aggregate and compare data.

### Crosstab
- Compute cross-tabulations to analyze the relationship between two categorical variables:
  - Default behavior counts occurrences.
  - Use `aggfunc="mean"` for aggregating quantitative variables.
  - Ensure you select appropriate variables.

## MERGE & CONCAT

### Concatenation
- Combining DataFrames physically (not relationally):
  - Side by side: `concat` on `axis=1`.
    - Use when DataFrames don't share columns or have a common key.
  - Top & bottom: `concat` on `axis=0` (appending rows).
    - Suitable when DataFrames share columns.

### Merge (Pandas)
- Merge: Combining DataFrames based on common columns.

These recap points summarize key operations for data manipulation and analysis in Pandas. You can use these techniques to select, aggregate, and combine data efficiently, helping you gain insights from your datasets.

## Pandas usual methods

```python
df.head() # prints the head, default 5 rows
df.tail() # set the tail, default 5 rows
df.describe() # statistical description
df.info() # df information
df.columns # show column
df.index # show index
df.dtypes # show column data types
df.plot() # make a plot
df.hist() # make a histogram
df.col.value_counts() # counts the unique values of a column
df.col.unique() # returns unique values from a column
df.copy() # copies the df
df.drop() # remove columns or rows (axis=0,1)
df.dropna() # remove nulls
df.fillna() # fills nulls
df.shape # dimensions of the df
df._get_numeric_data() # select numeric columns
df.rename() # rename columns
df.str.replace() # replace columns of strings
df.astype(dtype='float32') # change the data type
df.iloc[] # locate by index
df.loc[] # locate by element
df.transpose() # transposes the df
df.T
df.sample(n, frac) # sample from df
df.col.sum() # sum of a column
df.col.max() # maximum of a column
df.col.min() # minimum of one column
df[col] # select column
df.col
df.isnull() # null values
df.isna()
df.notna() # not null values
df.drop_duplicates() # remove duplicates
df.reset_index(inplace=True) # reset the index and overwrite
```

## Further materials

* [Read the docs!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Exercises to practice](https://github.com/guipsamora/pandas_exercises)
* [More on merge, concat, and join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). And [even more!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)